#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Examples-2/learn-terraform-cloud/runs/run-in8hDAGjHZqs7kMb

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
aws_vpc.Terraformlab: Refreshing state... [id=vpc-0d4aa2afad95da23b]
data.aws_ami.ubuntu: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0aa2b7722dc1b5612]
aws_internet_gateway.Terraformlab: Refreshing state... [id=igw-0092592583ed74486]
aws_subnet.Terraformlab-public-2: Refreshing state... [id=subnet-0d2711b57f46e6651]
aws_subnet.Terraformlab-public-1: Refreshing state... [id=subnet-08140daf71b3e4c2f]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:818871287066:targetgroup/my-tg20230414221838833500000001/08d66dec70a211c8]
aws_security_group.Terraformlab: Refreshing state... [id=sg-0b98b0552cbab13f0]
aws_route_table.Terraformlab: Refreshing state... [id=rtb-006ab39c6486416c9]
aws_instance.EC2-2: Refreshing state... [id=i-0bfbb09f8644a538e]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:818871287066:loadbalancer/app/T-alb/af355ca6ad53a255]
aws_instance.EC2-1: Refreshing state... [id=i-0f3d86700b4af3aa8]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-0e361ff84e51321cd]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-04aeb14eb855ec7fc]
aws_lb_listener.alb_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:818871287066:listener/app/T-alb/af355ca6ad53a255/622f606853b0bb50]
aws_lb_target_group_attachment.lab-2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:818871287066:targetgroup/my-tg20230414221838833500000001/08d66dec70a211c8-20230414223443509700000001]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:818871287066:targetgroup/my-tg20230414221838833500000001/08d66dec70a211c8-20230414223453508300000002]
aws_instance.EC2-2: Drift detected (update)
aws_instance.EC2-1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                          = "arn:aws:ec2:us-east-1:818871287066:instance/i-0f3d86700b4af3aa8" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0f3d86700b4af3aa8" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0bfc5331b5b0bf3e6" -> (known after apply)
      ~ private_dns                  = "ip-10-0-1-112.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.0.1.112" -> (known after apply)
      ~ public_dns                   = "ec2-44-204-86-35.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "44.204.86.35" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [ # forces replacement
          + "sg-0b98b0552cbab13f0",
        ]
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0b98b0552cbab13f0",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ae07686e32e75870" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                          = "arn:aws:ec2:us-east-1:818871287066:instance/i-0bfbb09f8644a538e" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0bfbb09f8644a538e" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0077b96ca43ebd816" -> (known after apply)
      ~ private_dns                  = "ip-10-0-2-248.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.0.2.248" -> (known after apply)
      ~ public_dns                   = "ec2-3-91-5-187.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "3.91.5.187" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [ # forces replacement
          + "sg-0b98b0552cbab13f0",
        ]
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0b98b0552cbab13f0",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e4d6799fd9949c42" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:818871287066:targetgroup/my-tg20230414221838833500000001/08d66dec70a211c8-20230414223453508300000002" -> (known after apply)
      ~ target_id        = "i-0f3d86700b4af3aa8" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:818871287066:targetgroup/my-tg20230414221838833500000001/08d66dec70a211c8-20230414223443509700000001" -> (known after apply)
      ~ target_id        = "i-0bfbb09f8644a538e" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```
</details>
*Pushed by: @hibbardr, Action: `pull_request`*